OFsolvers/tutorial_cases/loop_reactor_Disk_mixer_source/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \\    /   O peration     | Website:  https://openfoam.org
  \\  /    A nd           | Version:  dev
  \\/     M anipulation  |
  \*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
 //layer 0
 (-0.1  -0.1   -0.1)
 (2.2   -0.1   -0.1)
 (2.2    1.1   -0.1)
 (-0.1   1.1   -0.1)
 (-0.1  -0.1    0.95)
 (2.2   -0.1    0.95)
 (2.2    1.1    0.95)
 (-0.1   1.1    0.95)
);

blocks
(
 //block 0
 hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xlo
    {
        type wall;
        faces
        (
            (3 0 7 4)
        );
    }
    
    xhi
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }

    outlet
    {
        type patch;
        faces
        (
           (4 5 6 7)
        );
    }
    
    zlo
    {
        type patch;
        faces
        (
           (0 1 2 3)
        );
    }
    
    ylo
    {
        type wall;
        faces
        (
           (0 1 5 4)
        );
    }
    yhi
    {
        type wall;
        faces
        (
           (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
