OFsolvers/tutorial_cases/loop_reactor_Disk_mixer_source/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    pipes.stl
    {
        type        triSurfaceMesh;
        name        pipes;
    }
    cyl1
    {
      type searchableCylinder;
      point1 (-0.1   0.0 0.0);
      point2 ( 0.07  0.0 0.0);
      radius 0.01;
    }
    cyl2
    {
      type searchableCylinder;
      point1 (0.07  0.0 0.0);
      point2 (0.15  0.0 0.0);
      radius 0.02;
    }
    cyl3
    {
      type searchableCylinder;
      point1 (1.93   1.01 0.0);
      point2 (1.93   0.95 0.0);
      radius 0.01;
    }
    cyl4
    {
      type searchableCylinder;
      point1 (1.93  0.95 0.0);
      point2 (1.93  0.90 0.0);
      radius 0.02;
    }
}


castellatedMeshControls
{

    maxLocalCells 100000;

    maxGlobalCells 1000000;

    minRefinementCells 1;

    nCellsBetweenLevels 2;

    maxLoadUnbalance 0.10;

    features
    (
    );

    resolveFeatureAngle 30;

    refinementSurfaces
    {
        cyl1
        {
            level       (2 2);
        }
        cyl2
        {
            level       (2 2);
        }
        cyl3
        {
            level       (2 2);
        }
        cyl4
        {
            level       (2 2);
        }
        pipes
        {
            level       (2 2);
        }
    }

    refinementRegions
    {
    }

    locationInMesh (1.0 0.0 0.0); // Inside point

    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{

    nSmoothPatch 3;

    tolerance 1.0;

    nSolveIter 300;

    nRelaxIter 10;

    nFeatureSnapIter 10;

    implicitFeatureSnap true;

    explicitFeatureSnap false;

    multiRegionFeatureSnap true;
}

// Settings for the layer addition.
addLayersControls
{

    relativeSizes true;

    layers
    {
    }

    expansionRatio 1.0;

    finalLayerThickness 0.0005;

    minThickness 0.00025;

    nGrow 0;

    featureAngle 30;

    nRelaxIter 10;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;

    nRelaxedIter 20;
}

meshQualityControls
{
    //- Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 65;

    //- Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    //- Max concaveness allowed. Is angle (in degrees) below which concavity
    //  is allowed. 0 is straight face, <0 would be convex face.
    //  Set to 180 to disable.
    maxConcave 80;

    //- Minimum pyramid volume. Is absolute volume of cell pyramid.
    //  Set to a sensible fraction of the smallest cell volume expected.
    //  Set to very negative number (e.g. -1E30) to disable.
    minVol 1e-13;

    //- Minimum quality of the tet formed by the face-centre
    //  and variable base point minimum decomposition triangles and
    //  the cell centre. This has to be a positive number for tracking
    //  to work. Set to very negative number (e.g. -1E30) to
    //  disable.
    //     <0 = inside out tet,
    //      0 = flat tet
    //      1 = regular tet
    minTetQuality -1; // 1e-30;

    //- Minimum face area. Set to <0 to disable.
    minArea -1;

    //- Minimum face twist. Set to <-1 to disable. dot product of face normal
    //  and face centre triangles normal
    minTwist 0.01;

    //- Minimum normalised cell determinant
    //  1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;

    //- minFaceWeight (0 -> 0.5)
    minFaceWeight 0.05;

    //- minVolRatio (0 -> 1)
    minVolRatio 0.01;

    //must be >0 for Fluent compatibility
    minTriangleTwist -1;


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- Amount to scale back displacement at error points
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

writeFlags
(
);

mergeTolerance 1E-6;


// ************************************************************************* //
