OFsolvers/tutorial_cases/loop_reactor_Disk_mixer_source/0.org/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cyl2
    {
        type               fixedValue;
        value              $internalField;
    }
    cyl4
    {
        type               fixedValue;
        value              $internalField;
    }
    cyl1
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
    cyl3
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
    outlet
    {
        type               pressureInletOutletVelocity;
        phi                phi.liquid;
        value              $internalField;
    }
    walls
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
    pipes
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
}

// ************************************************************************* //
