OFsolvers/tutorial_cases/loop_reactor_Disk_mixer_source/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 1e5;

boundaryField
{
    cyl1
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    cyl2
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    cyl3
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    cyl4
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    outlet
    {
        type               prghPressure;
        p                  $internalField;
        value              $internalField;
    }
    walls
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    pipes
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
