OFsolvers/tutorial_cases/loop_reactor_Disk_mixer_source/0.org/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/globalTransport"

dimensions          [0 0 0 1 0 0 0];

internalField       uniform $Temp;

boundaryField
{
    cyl2
    {
        type               zeroGradient;
    }
    cyl4
    {
        type               zeroGradient;
    }
    walls
    {
        type               zeroGradient;
    }
    pipes
    {
        type               zeroGradient;
    }
    outlet
    {
        type               inletOutlet;
        phi                phi.liquid;
        inletValue         $internalField;
        value              $internalField;
    }
    cyl1
    {
        type                zeroGradient;
    }
    cyl3
    {
        type                zeroGradient;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
